.metadata/.plugins/org.eclipse.core.resources/.history/bf/500a483321a4001f1f1097a5b94c91cf

<?xml version="1.0" encoding="UTF-8"?>
<api context="/cdata" name="cdata" xmlns="http://ws.apache.org/ns/synapse">
    <resource methods="POST">
        <inSequence>
            <property expression="$body//typ:CreateTransaction" name="fcubs_req_env" scope="default" type="STRING" xmlns:typ="http://types.ws.gw.fcubs.iflex.com"/>
            <log level="custom">
                <property expression="get-property('fcubs_req_env')" name="fcubs_req_env"/>
            </log>
            <property name="source" scope="default" type="STRING" value="1234"/>
            <payloadFactory media-type="xml">
                <format>
                    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://types.ws.gw.fcubs.iflex.com">
                        <soapenv:Header/>
                        <soapenv:Body>
                            <typ:CreateTransaction><![CDATA[
                    <FCUBS_REQ_ENV xmlns="http://fcubs.iflex.com/service/FCUBSRTService/CreateTransaction">
                        <FCUBS_HEADER>
                            <SOURCE>$1</SOURCE>
                            <UBSCOMP>FCUBS</UBSCOMP>
                            <USERID>AL01USRU</USERID>
                            <BRANCH>094</BRANCH>
                            <SERVICE>FCUBSRTService</SERVICE>
                            <OPERATION>CreateTransaction</OPERATION>
                        </FCUBS_HEADER>
                        <FCUBS_BODY>
                            <Transaction-Details-IO>
                                <XREF>RGV7UQA169-70365807</XREF>
                                <PRD>SMSP</PRD>
                                <BRN>094</BRN>
                                <TXNBRN>094</TXNBRN>
                                <TXNACC>094000023874</TXNACC>
                                <TXNCCY>KES</TXNCCY>
                                <TXNTRN>PYB</TXNTRN>
                                <OFFSETBRN>000</OFFSETBRN>
                                <OFFSETACC>A01040002</OFFSETACC>
                                <OFFSETCCY>KES</OFFSETCCY>
                                <OFFSETAMT>1000.00</OFFSETAMT>
                                <NARRATIVE>From 254703658077 katana Jacob Alias Code 156452</NARRATIVE>
                            </Transaction-Details-IO>
                        </FCUBS_BODY>
                    </FCUBS_REQ_ENV>
                    ]]></typ:CreateTransaction>
                        </soapenv:Body>
                    </soapenv:Envelope>
                </format>
                <args>
                    <arg evaluator="xml" expression="$ctx:source"/>
                </args>
            </payloadFactory>
            <log level="full"/>
            <respond/>
        </inSequence>
        <outSequence/>
        <faultSequence/>
    </resource>
</api>
